/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mbarra <mbarra@student.21-school.ru>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/06/08 22:05:57 by mbarra            #+#    #+#             */
/*   Updated: 2022/06/08 22:05:57 by mbarra           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Zombie.hpp"

// TODO лики проверить и написать тесты
int main ( void ){
	Zombie* zombie = Zombie::zombieHorde(5, "Foo");
	zombie[0].announce();

	return (0);
}